In [1]:
import pandas as pd
import os
import numpy as np

In [2]:
def check_file():
    for file in os.listdir():
        if file.endswith('.csv'):
            return file
    raise Exception('file not found')

In [4]:
check_file()

'Bengaluru_House_Data.csv'

In [5]:
file_name=check_file()

In [6]:
df=pd.read_csv(file_name)

In [7]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [9]:
for col in df.columns:
    print(df[col].value_counts())
    print('*'*20)

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64
********************
availability
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: count, Length: 81, dtype: int64
********************
location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64
********************
size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64
********************
society
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: count, Length: 2688, dtype: int64
********************
total_sqft
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: count, Length: 2117, dtype: int64
********************
bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: count, dtype: int64
********************
balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64
********************
price
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: count, Length: 1994, dtype: int64
********************

In [11]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [12]:
df.drop(columns=['area_type','availability','society','balcony'],inplace=True)

In [16]:
df.describe(include='all')

          location   size total_sqft          bath         price
count        13319  13304      13320  13247.000000  13320.000000
unique        1305     31       2117           NaN           NaN
top     Whitefield  2 BHK       1200           NaN           NaN
freq           540   5199        843           NaN           NaN
mean           NaN    NaN        NaN      2.692610    112.565627
std            NaN    NaN        NaN      1.341458    148.971674
min            NaN    NaN        NaN      1.000000      8.000000
25%            NaN    NaN        NaN      2.000000     50.000000
50%            NaN    NaN        NaN      2.000000     72.000000
75%            NaN    NaN        NaN      3.000000    120.000000
max            NaN    NaN        NaN     40.000000   3600.000000

In [23]:
pd.set_option('display.max_rows',80)
pd.set_option('display.max_columns',80)

In [25]:
df['location'].value_counts()

location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64

In [39]:
df['location'].mode()[0]

'Whitefield'

In [40]:
df['location']=df['location'].fillna(df['location'].mode()[0])

In [42]:
df['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [44]:
df['size'].isna().sum()

16

In [46]:
df['size']=df['size'].fillna(df['size'].mode()[0])

In [48]:
df['size'].isna().sum()

0

In [51]:
df['total_sqft'].value_counts()

total_sqft
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: count, Length: 2117, dtype: int64

In [59]:
df['bath'].value_counts()

bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: count, dtype: int64

In [61]:
df['bath']=df['bath'].fillna(df['bath'].mode()[0])

In [65]:
df['price'].value_counts()

price
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: count, Length: 1994, dtype: int64

In [67]:
df['price'].isna().sum()

0

In [69]:
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [76]:
df['BHK']=df['size'].str.split(' ').str.get(0).astype(int)

In [83]:
df['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [91]:
def convert_range(price):
    temp=price.split('-')
    if len(temp)==2:
        return (float(temp[0])+ float(temp[1]))/2
    try:
        return float(price)
    except:
        return None

In [92]:
df['total_sqft']=df['total_sqft'].apply(convert_range)

In [97]:
df['price_per_sqft']=df['price']*100000/df['total_sqft']

         total_sqft          bath         price           BHK  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [103]:
df['location'].value_counts()

location
Whitefield                        541
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64

In [105]:
df['location']=df['location'].apply(lambda x :x.strip())

In [107]:
location_count=df['location'].value_counts()

In [108]:
location_count

location
Whitefield                        542
Sarjapur  Road                    399
Electronic City                   304
Kanakpura Road                    273
Thanisandra                       237
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1294, dtype: int64

In [110]:
location_count_10=location_count[location_count<=10]

In [112]:
df['location']=df['location'].apply(lambda x :'Other' if x in location_count_10 else x)

In [113]:
df['location'].value_counts()

location
Other                 2885
Whitefield             542
Sarjapur  Road         399
Electronic City        304
Kanakpura Road         273
                      ...
Nehru Nagar             11
Banjara Layout          11
LB Shastri Nagar        11
Pattandur Agrahara      11
Narayanapura            11
Name: count, Length: 242, dtype: int64

In [115]:
df.describe(include='all')

,location,size,total_sqft,bath,price,BHK,price_per_sqft
count,13320,13320,13274.000000,13320.000000,13320.000000,13320.000000,1.327400e+04
unique,242,31,NaN,NaN,NaN,NaN,NaN
top,Other,2 BHK,NaN,NaN,NaN,NaN,NaN
freq,2885,5215,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,1559.626694,2.688814,112.565627,2.802778,7.907501e+03
std,NaN,NaN,1238.405258,1.338754,148.971674,1.294496,1.064296e+05
min,NaN,NaN,1.000000,1.000000,8.000000,1.000000,2.678298e+02
25%,NaN,NaN,1100.000000,2.000000,50.000000,2.000000,4.266865e+03
50%,NaN,NaN,1276.000000,2.000000,72.000000,3.000000,5.434306e+03
75%,NaN,NaN,1680.000000,3.000000,120.000000,3.000000,7.311746e+03
max,NaN,NaN,52272.000000,40.000000,3600.000000,43.000000,1.200000e+07

In [117]:
df['total_sqft_per_bhk']=df['total_sqft']/df['BHK']

In [119]:
df.describe()

,total_sqft,bath,price,BHK,price_per_sqft,total_sqft_per_bhk
count,13274.000000,13320.000000,13320.000000,13320.000000,1.327400e+04,13274.000000
mean,1559.626694,2.688814,112.565627,2.802778,7.907501e+03,575.074878
std,1238.405258,1.338754,148.971674,1.294496,1.064296e+05,388.205175
min,1.000000,1.000000,8.000000,1.000000,2.678298e+02,0.250000
25%,1100.000000,2.000000,50.000000,2.000000,4.266865e+03,473.333333
50%,1276.000000,2.000000,72.000000,3.000000,5.434306e+03,552.500000
75%,1680.000000,3.000000,120.000000,3.000000,7.311746e+03,625.000000
max,52272.000000,40.000000,3600.000000,43.000000,1.200000e+07,26136.000000

In [120]:
df=df[df['total_sqft_per_bhk']>=300]

In [121]:
df

,location,size,total_sqft,bath,price,BHK,price_per_sqft,total_sqft_per_bhk
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606,528.00
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615,650.00
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556,480.00
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861,507.00
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000,600.00
...,...,...,...,...,...,...,...,...
13315,Whitefield,5 Bedroom,3453.0,4.0,231.00,5,6689.834926,690.60
13316,Other,4 BHK,3600.0,5.0,400.00,4,11111.111111,900.00
13317,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,60.00,2,5258.545136,570.50
13318,Padmanabhanagar,4 BHK,4689.0,4.0,488.00,4,10407.336319,1172.25
13319,Doddathoguru,1 BHK,550.0,1.0,17.00,1,3090.909091,550.00